Autodesk.Revit.DB.TessellatedBuildIssue.ReportIssueToDataSource
Reports whether this issue should be reported to the
company which wrote the software which produced the face set data
(true), or to Autodesk (false).
Since:
2015

Autodesk.Revit.DB.TessellatedBuildIssue.MakesDataUnusable
Reports whether this issue makes some data unusable ('true')
or is only shows that data format conventions were broken,
but the data are still usable (false).
Since:
2015

Autodesk.Revit.DB.TessellatedBuildIssue.GetIssueDescription
Gets a string describing the issue. If the issue does
not present a problem, then an empty string is returned.
Returns:
Description of the issue.
Since:
2015

Autodesk.Revit.DB.TessellatedBuildIssue.IsValidIssue
Reports whether the issue is well-formed, valid and does
describe a real problem.
Returns:
Whether the issue is well formed and does describe a real problem.
Since:
2015

Autodesk.Revit.DB.TessellatedBuildIssue.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TessellatedBuildIssue.NumberEncountered
How many times this issue was encountered in its face set
during the face set processing. This number can be less
than the total number of such issues in the face set, as
the face set processing could be aborted due to
the presence of the issues which could not be handled.
Since:
2015

Autodesk.Revit.DB.TessellatedBuildIssue
Types of issues encountered while constructing geometrical objects
from the tessellated face sets.
Since:
2015